In [7]:
#pandas is a software library written for the Python programming language for data manipulation and analysis

import pandas as pd
#files in--->c/users/abc

In [16]:
import csv

header = ['name', 'area', 'country_code2', 'country_code3']
data = [
    ['Albania', 28748, 'AL', 'ALB'],
    ['Algeria', 2381741, 'DZ', 'DZA'],
    ['American Samoa', 199, 'AS', 'ASM'],
    ['Andorra', 468, 'AD', 'AND'],
    ['Angola', 1246700, 'AO', 'AGO']
]

with open('countries.csv', 'w', encoding='UTF8', newline='') as f:
    writer = csv.writer(f)

    # write the header
    writer.writerow(header)

    # write multiple rows
    writer.writerows(data)

In [21]:
df=pd.read_csv('countries.csv')#df--->data frame

In [22]:
df.head()

             name     area country_code2 country_code3
0         Albania    28748            AL           ALB
1         Algeria  2381741            DZ           DZA
2  American Samoa      199            AS           ASM
3         Andorra      468            AD           AND
4          Angola  1246700            AO           AGO

In [23]:
df.head(2)#prints 2 lines of csv

      name     area country_code2 country_code3
0  Albania    28748            AL           ALB
1  Algeria  2381741            DZ           DZA

In [25]:
df['name'] #prints name of all countries

0           Albania
1           Algeria
2    American Samoa
3           Andorra
4            Angola
Name: name, dtype: object

In [29]:
#To convert all names into a list format

countries=df['name'].values
print(countries)

['Albania' 'Algeria' 'American Samoa' 'Andorra' 'Angola']

In [27]:
df['area'] #prints area of all countries

0      28748
1    2381741
2        199
3        468
4    1246700
Name: area, dtype: int64

In [30]:
#To convert all country areas into a list format

area=df['area'].values
print(area)

[  28748 2381741     199     468 1246700]

In [44]:
#to convert the whole data into an array
data=df.values#2-D Array
data

array([['Albania', 28748, 'AL', 'ALB'],
       ['Algeria', 2381741, 'DZ', 'DZA'],
       ['American Samoa', 199, 'AS', 'ASM'],
       ['Andorra', 468, 'AD', 'AND'],
       ['Angola', 1246700, 'AO', 'AGO']], dtype=object)

In [45]:
#we do the following for using index in 1-D List
list=[1,2,3,5,7,7,6,5]
print(list[2:7])

[3, 5, 7, 7, 6]

In [52]:
#we do the following for using index in 2-D List
print(data[:,:])#to print the whole 2-D list
print("")
data[:1,:]#print all data of the 1st row
print("")
data[:2,:]#print all data of first 2 rows
print("")
data[2:,:]#print all rows from 2nd index and onwards
print("")
print(data[:,2:])#print all data of last 2 columns
print("")
print(data[2:3,2:3])#print 3rd row:3rd column

[['Albania' 28748 'AL' 'ALB']
 ['Algeria' 2381741 'DZ' 'DZA']
 ['American Samoa' 199 'AS' 'ASM']
 ['Andorra' 468 'AD' 'AND']
 ['Angola' 1246700 'AO' 'AGO']]




[['AL' 'ALB']
 ['DZ' 'DZA']
 ['AS' 'ASM']
 ['AD' 'AND']
 ['AO' 'AGO']]

[['AS']]